In [26]:
import pandas as pd
import numpy as np
from numpy.random import randn

In [14]:
np.random.seed(101)

In [5]:
labels = ["a","b","c"]
my_data = [10,20,30]
arr = np.array(my_data)
d = {"a":10,"b":20,"c":30}

In [10]:
pd.Series(data=my_data,index=labels)

a    10
b    20
c    30
dtype: int64

In [13]:
pd.Series(data=labels, index=my_data)

10    a
20    b
30    c
dtype: object

In [93]:
df = pd.DataFrame(randn(5,4),["A","B","C","D","E"],["F","G","H","I"])

In [94]:
df

          F         G         H         I
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [32]:
df.F

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: F, dtype: float64

In [29]:
df["F"]

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: F, dtype: float64

In [31]:
type(df["F"])

pandas.core.series.Series

In [33]:
df[["G","H"]]

          G         H
A  0.628133  0.907969
B -0.319318 -0.848077
C  0.740122  0.528813
D -0.758872 -0.933237
E  1.978757  2.605967

In [35]:
df["new"]=df["G"]+df["H"]

In [82]:
df

          G         H         I       new
A  0.628133  0.907969  0.503826  1.536102
B -0.319318 -0.848077  0.605965 -1.167395
C  0.740122  0.528813 -0.589001  1.268936
D -0.758872 -0.933237  0.955057 -1.692109
E  1.978757  2.605967  0.683509  4.584725

In [38]:
df.drop("F",axis=1)

          G         H         I       new
A  0.628133  0.907969  0.503826  1.536102
B -0.319318 -0.848077  0.605965 -1.167395
C  0.740122  0.528813 -0.589001  1.268936
D -0.758872 -0.933237  0.955057 -1.692109
E  1.978757  2.605967  0.683509  4.584725

In [39]:
df

          F         G         H         I       new
A  2.706850  0.628133  0.907969  0.503826  1.536102
B  0.651118 -0.319318 -0.848077  0.605965 -1.167395
C -2.018168  0.740122  0.528813 -0.589001  1.268936
D  0.188695 -0.758872 -0.933237  0.955057 -1.692109
E  0.190794  1.978757  2.605967  0.683509  4.584725

In [40]:
df.drop("F",axis=1,inplace=True)

In [41]:
df

          G         H         I       new
A  0.628133  0.907969  0.503826  1.536102
B -0.319318 -0.848077  0.605965 -1.167395
C  0.740122  0.528813 -0.589001  1.268936
D -0.758872 -0.933237  0.955057 -1.692109
E  1.978757  2.605967  0.683509  4.584725

In [42]:
df.drop("E")

          G         H         I       new
A  0.628133  0.907969  0.503826  1.536102
B -0.319318 -0.848077  0.605965 -1.167395
C  0.740122  0.528813 -0.589001  1.268936
D -0.758872 -0.933237  0.955057 -1.692109

In [43]:
df

          G         H         I       new
A  0.628133  0.907969  0.503826  1.536102
B -0.319318 -0.848077  0.605965 -1.167395
C  0.740122  0.528813 -0.589001  1.268936
D -0.758872 -0.933237  0.955057 -1.692109
E  1.978757  2.605967  0.683509  4.584725

In [47]:
df.loc["A"]

G      0.628133
H      0.907969
I      0.503826
new    1.536102
Name: A, dtype: float64

In [50]:
df.iloc[0]

G      0.628133
H      0.907969
I      0.503826
new    1.536102
Name: A, dtype: float64

In [52]:
df.loc["C","H"]

0.5288134940893595

In [53]:
df.shape

(5, 4)

In [54]:
df

          G         H         I       new
A  0.628133  0.907969  0.503826  1.536102
B -0.319318 -0.848077  0.605965 -1.167395
C  0.740122  0.528813 -0.589001  1.268936
D -0.758872 -0.933237  0.955057 -1.692109
E  1.978757  2.605967  0.683509  4.584725

In [55]:
df.loc[["B","D"],["G","I"]]

          G         I
B -0.319318  0.605965
D -0.758872  0.955057

In [56]:
df>0

       G      H      I    new
A   True   True   True   True
B  False  False   True  False
C   True   True  False   True
D  False  False   True  False
E   True   True   True   True

In [61]:
G = df[df["G"]>0]

In [64]:
G["H"]

A    0.907969
C    0.528813
E    2.605967
Name: H, dtype: float64

In [65]:
df

          G         H         I       new
A  0.628133  0.907969  0.503826  1.536102
B -0.319318 -0.848077  0.605965 -1.167395
C  0.740122  0.528813 -0.589001  1.268936
D -0.758872 -0.933237  0.955057 -1.692109
E  1.978757  2.605967  0.683509  4.584725

In [75]:
df[df["H"]>0][["G","I"]]

          G         I
A  0.628133  0.503826
C  0.740122 -0.589001
E  1.978757  0.683509

In [86]:
df[(df["G"]>0) & (df["I"]>0)]
# use & and | to apply multiple conditions

          F         G         H         I
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
E -0.116773  1.901755  0.238127  1.996652

In [85]:
df

          F         G         H         I
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [90]:
df.reset_index(inplace=True)

In [91]:
df

   level_0 index         F         G         H         I
0        0     A  0.302665  1.693723 -1.706086 -1.159119
1        1     B -0.134841  0.390528  0.166905  0.184502
2        2     C  0.807706  0.072960  0.638787  0.329646
3        3     D -0.497104 -0.754070 -0.943406  0.484752
4        4     E -0.116773  1.901755  0.238127  1.996652

In [95]:
new_index= "NY CA OR NJ CO".split()

In [96]:
new_index

['NY', 'CA', 'OR', 'NJ', 'CO']

In [97]:
df["State"]=new_index

In [98]:
df

          F         G         H         I State
A -0.993263  0.196800 -1.136645  0.000366    NY
B  1.025984 -0.156598 -0.031579  0.649826    CA
C  2.154846 -0.610259 -0.755325 -0.346419    OR
D  0.147027 -0.479448  0.558769  1.024810    NJ
E -0.925874  1.862864 -1.133817  0.610478    CO

In [99]:
df.set_index("State")

              F         G         H         I
State
NY    -0.993263  0.196800 -1.136645  0.000366
CA     1.025984 -0.156598 -0.031579  0.649826
OR     2.154846 -0.610259 -0.755325 -0.346419
NJ     0.147027 -0.479448  0.558769  1.024810
CO    -0.925874  1.862864 -1.133817  0.610478

In [100]:
df

          F         G         H         I State
A -0.993263  0.196800 -1.136645  0.000366    NY
B  1.025984 -0.156598 -0.031579  0.649826    CA
C  2.154846 -0.610259 -0.755325 -0.346419    OR
D  0.147027 -0.479448  0.558769  1.024810    NJ
E -0.925874  1.862864 -1.133817  0.610478    CO

In [101]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [105]:
df = pd.DataFrame(randn(6,3),hier_index,["A","B","C"])

In [106]:
df

             A         B         C
G1 1 -1.046780  1.292765 -1.467514
   2 -0.494095 -0.162535  0.485809
   3  0.392489  0.221491 -0.855196
G2 1  1.541990  0.666319 -0.538235
   2 -0.568581  1.407338  0.641806
   3 -0.905100 -0.391157  1.028293

In [107]:
df.loc["G1"]

          A         B         C
1 -1.046780  1.292765 -1.467514
2 -0.494095 -0.162535  0.485809
3  0.392489  0.221491 -0.855196

In [108]:
df["A"]

G1  1   -1.046780
    2   -0.494095
    3    0.392489
G2  1    1.541990
    2   -0.568581
    3   -0.905100
Name: A, dtype: float64

In [111]:
df.iloc[1]

A   -0.494095
B   -0.162535
C    0.485809
Name: (G1, 2), dtype: float64

In [112]:
df.index.names

FrozenList([None, None])

In [113]:
df.index.names = ["Groups","Num"]

In [114]:
df

                   A         B         C
Groups Num
G1     1   -1.046780  1.292765 -1.467514
       2   -0.494095 -0.162535  0.485809
       3    0.392489  0.221491 -0.855196
G2     1    1.541990  0.666319 -0.538235
       2   -0.568581  1.407338  0.641806
       3   -0.905100 -0.391157  1.028293

In [116]:
df.loc["G1"].loc[2]["B"]

-0.1625347347726149

In [117]:
df.loc["G2"].loc[3]["C"]

1.0282931608187034

In [120]:
df.loc["G1"]

            A         B         C
Num
1   -1.046780  1.292765 -1.467514
2   -0.494095 -0.162535  0.485809
3    0.392489  0.221491 -0.855196

In [119]:
df.xs("G1")

            A         B         C
Num
1   -1.046780  1.292765 -1.467514
2   -0.494095 -0.162535  0.485809
3    0.392489  0.221491 -0.855196

In [121]:
df.xs(1,level="Num")

              A         B         C
Groups
G1     -1.04678  1.292765 -1.467514
G2      1.54199  0.666319 -0.538235

In [148]:
d = {"A":[1,2,np.nan,3],"B":[5,np.nan,np.nan,np.nan],"C":[1,2,3,4],"D":[1,2,np.nan,np.nan]}

In [149]:
df = pd.DataFrame(data=d)

In [140]:
df

     A    B  C    D
0  1.0  5.0  1  1.0
1  2.0  NaN  2  2.0
2  NaN  NaN  3  NaN
3  3.0  NaN  4  NaN

In [141]:
df.dropna()

     A    B  C    D
0  1.0  5.0  1  1.0

In [142]:
df.dropna(thresh=2) 
# thresh keeps rows that has at least 2 values

     A    B  C    D
0  1.0  5.0  1  1.0
1  2.0  NaN  2  2.0
3  3.0  NaN  4  NaN

In [151]:
df.fillna("fill value")

            A           B  C           D
0           1           5  1           1
1           2  fill value  2           2
2  fill value  fill value  3  fill value
3           3  fill value  4  fill value

In [152]:
df

     A    B  C    D
0  1.0  5.0  1  1.0
1  2.0  NaN  2  2.0
2  NaN  NaN  3  NaN
3  3.0  NaN  4  NaN

In [155]:
df["A"].fillna(df["A"].mean(),inplace=True)

In [156]:
df

     A    B  C    D
0  1.0  5.0  1  1.0
1  2.0  NaN  2  2.0
2  2.0  NaN  3  NaN
3  3.0  NaN  4  NaN

In [157]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [158]:
df = pd.DataFrame(data)

In [159]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [161]:
my_com = df.groupby("Company")

In [163]:
my_com.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [165]:
my_com.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [167]:
df.groupby("Company").count().loc["GOOG"]

Person    2
Sales     2
Name: GOOG, dtype: int64

In [172]:
df.groupby("Company").describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [173]:
df.groupby("Company").describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [174]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [175]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [176]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [177]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [178]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [179]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [184]:
df = pd.concat([df1,df2,df3])

In [183]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [185]:
df.describe()

         A   B    C   D
count   12  12   12  12
unique  12  12   12  12
top     A4  B4  C11  D0
freq     1   1    1   1

In [187]:
df.head()

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4

In [188]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [193]:
df["col2"].nunique()

3

In [194]:
df["col2"].unique()

array([444, 555, 666])

In [196]:
df["col2"].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [197]:
def power2(x):
    return x**2

In [198]:
df["col2"].apply(power2)

0    197136
1    308025
2    443556
3    197136
Name: col2, dtype: int64

In [199]:
df["col2"].apply(lambda x:x*5)

0    2220
1    2775
2    3330
3    2220
Name: col2, dtype: int64

In [201]:
df.drop("col1",axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [204]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [205]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [208]:
df.sort_values("col2")

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [209]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [214]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [234]:
df = pd.read_csv("example")

In [225]:
df.to_html("example_html",index=False)

In [226]:
pd.read_html("example_html")

[    a   b   c   d
 0   0   1   2   3
 1   4   5   6   7
 2   8   9  10  11
 3  12  13  14  15]

In [229]:
pd.read_excel("Excel_Sample.xlsx",sheet_name="Sheet1")

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [231]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [237]:
df.to_excel("Excel_Sample3.xlsx",sheet_name="NewSheet")

In [246]:
data = pd.read_html("https://questionnaire-148920.appspot.com/swe/data.html")

In [250]:
type(data)

list

In [253]:
data[0].head()

              Player       Salary  Year Level
0        Abreu, Jose  $11,666,667  2016   MLB
1    Acevedo, Andury          NaN  2016   MLB
2     Ackley, Dustin   $3,200,000  2016   MLB
3  Adames, Cristhian     $507,500  2016   MLB
4      Adams, Austin     $507,500  2016   MLB

In [254]:
from sqlalchemy import create_engine

In [255]:
engine=create_engine("sqlite:///:memory:")

In [256]:
df.to_sql("my_table",engine)

In [257]:
sqldf = pd.read_sql("my_table",con=engine)

In [258]:
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15